{
  "id": "Brother-HL-2030",
  "manufacturer": "Brother",
  "model": "HL-2030",
  "series": "",
  "connectivity": [],
  "recommended_driver": "driver/hl1250",
  "drivers": [
    {
      "id": "driver/gutenprint",
      "name": "gutenprint",
      "url": "http://gimp-print.sourceforge.net/",
      "comments": "<B>This driver is available in the <A href=\"https://github.com/OpenPrinting/gutenprint-printer-app\">Gutenprint Printer Application</A></B><P>\n<iframe src=\"https://snapcraft.io/gutenprint-printer-app/embedded?button=black&summary=true\" frameborder=\"0\" width=\"100%\" height=\"300px\" style=\"border: 1px solid #CCC; border-radius: 2px;\"></iframe>\n\n    Gutenprint supports a wide variety of Epson Stylus, HP DeskJet,\n    Canon BubbleJet, Lexmark inkjet printers, PCL laser printers, and\n    Canon, Fujifilm, Sony, Olympus dye sublimation printers. Its\n    primary goal is uncompromising quality.  Epson Stylus printers in\n    particular are supported in all resolutions and modes, and the\n    latest printers are capable of producing prints that rival\n    photographic prints in quality. This package also offers much\n    faster printing for high quality text and presentation graphics\n    when required.<p>\n\n    Gutenprint is the successor of Gimp-Print, it was renamed with\n    the change from version 4.x to 5.x. All printers which worked with\n    Gimp-Print before, work also (and hopefully better) with\n    Gutenprint.<p>\n\n    The actual printer drivers are in the Gutenprint library. To give\n    access to them Gutenprint has various interfaces:<p>\n\n    <ol>\n\n    <li><em>Plug-in for the GIMP</em>: This plug-in\n    provides a printing dialog for the GIMP to print images directly,\n    and graphical controls to adjust the rich set of options of the\n    Gutenprint drivers. The possibility to integrate a PPD file and to\n    print PostScript allows to use the plug-in also with Ghostscript\n    drivers other than Gutenprint or on PostScript printers.<p>\n\n    <li><em>Native CUPS driver</em>: This interface\n    makes it possible to set up print queues under CUPS so that one\n    can print from any application or from the command line. As it\n    integrates directlty into the CUPS filtering system it is easy to\n    set up in any CUPS 1.1.x or CUPS 1.2.x version without need of any\n    additional software. With Foomatic it is even possible to use this\n    native CUPS driver with other spoolers than CUPS.<p>\n\n    <li><em>Ghostscript IJS plug-in</em>: This is a\n    way to use Gutenprint as a Ghostscript driver without necessity of\n    patching and recompiling Ghostscript. It uses the <a\n    href=\"http://www.openprinting.org/ijs/\">IJS</a>\n    plug-in interface as also <a\n    href=\"show_driver.cgi?driver=hpijs\">HPIJS</a>\n    from HP or <a\n    href=\"http://sourceforge.net/projects/epsonepl/\">the\n    drivers for the Epson EPL-....L series</a> do. IJS drivers\n    can be used with any IJS-enabled Ghostscript as ESP Ghostscript\n    7.x or newer, GNU Ghostscript 6.53 or newer, APFL Ghostscript 7.04\n    or newer. With the Foomatic data coming with Gutenprint and the\n    current <a\n    href=\"http://www.openprinting.org/foomatic.html\">Foomatic</a>\n    packages PPD files for use with all printing systems (CUPS, LPRng,\n    LPD, GNUlpr, PPR, PDQ, CPS, spooler-less printing) can be\n    generated. Print queues set up with these PPD files and\n    <tt>foomatic-rip</tt> give full access to all options\n    of the Gutenprint driver.<p>\n\n    </ol>\n\n    The Gutenprint package already ships with all needed PPD files for\n    CUPS and data files for Foomatic. Therefore we do not provide PPD\n    files for download here.<p>\n\n    If you got Gutenprint with your operating system distribution, use\n    the printer setup program coming with your distribution. Otherwise\n    it is recommended to use the CUPS driver if you use CUPS as your\n    printing system or the IJS driver if you use another\n    spooler.<p>\n\n    <b>IMPORTANT: Always use the Foomatic data and/or\n    PPD files of the Gutenprint version which you are actually using!\n    Remove and re-create your print queues after every update of\n    Gutenprint. If you are using the Gutenprint package of your Linux\n    distribution, it is possible that the Foomatic data and/or the PPD\n    files can be in separate packages. Make sure you install them and\n    that they are of the version corresponding to your Gutenprint\n    package.</b><p>\n\n    The information currently here corresponds to driver version\n    5.2.7. If you use another version, have a look in the\n    documentation coming with your Gutenprint package. If you have\n    still a 4.x version of Gimp-Print, it is highly recommended to\n    upgrade at least to Gutenprint 5.0.x.<p>\n\n    The driver package which is available for download here on this\n    site only contains the CUPS driver and the utilities (escputil,\n    cups-calibrate), it does not contain the IJS driver and the GIMP\n    plug-in.<p>",
      "execution": {
        "cups": null
      }
    }
  ],
  "type": "laser",
  "status": "good",
  "notes": "USB connection, max. paper size A4, toner-saving functionality\n      0, 25%, 50%<p>\n\n      Tested with CUPS on OpenSUSE 10.0:<p> <p>\n\n      Download-RPMs from Brother did not work, but using the PPD for\n      the Brother HL-2060 foomatic/hl1250 did work (Media Source:\n      Automatic, Media Type: Plain Paper, Page Size: A4, Resolution:\n      300dpi/600dpi, Toner-Saving: 0/25%/50%)<p>\n\n      Using kprinter-gui from KDE \"2 pages on one sheet\" did not work\n      (maybe solveable), but normal functions work without problems\n      under OpenOffice, KPDF, XPDF, Firefox ...<p>\n\n      <b>Another user:</b> Downloading and installing the\n      RPMs from Brother worked for me (using SuSE 10 and KDE). With\n      the HL-2030 drivers, the text was first shifted too far up on\n      the page; this went away after deleting the printer in YaST2 and\n      adding it again. Works fine now, difference to first user entry:\n      Toner Saving only \"on\" or \"off\", but can\n      select from a list of different paper sizes and media\n      types. Printing two or four pages per sheet works fine from\n      kpdf.<p>\n\n      <b>Another user:</b> On Fedora Core 4, with\n      KDE. hl1250 driver worked for me, except when printing 2 pages\n      on one sheet (margins were wrong). hl2030 driver from brother\n      works perfectly for me.<p>\n\n      <p><b>Another user:</b> Also works fine\n      (multiple pages, toner save etc) on Kubuntu 6.06 with the Debian\n      Brother drivers. Easy <a\n      href=http://www.ubuntuforums.org/showthread.php?t=123539>installation\n      instructions here</a>. I first had to <a\n      href=\"http://ubuntu.wordpress.com/2005/10/13/enabling-cupsys-web-admin-interface/\">enable\n      the browser-based admin for cupsys</a>.<p>\n\n      <p>Note: 12 Dec 06: Brother now seems to have new .deb\n      drivers that also support 1200 dpi resolution.<p>\n\n      <p><b>Another user:</b> If you only get\n      low-resolution graphics when printing PDFs (using Acrobat)\n      try using the hpijs-pcl5e driver instead of the recommended\n      hl1250.<p>\n\n      <p><b>Another user:</b> With Ubuntu 7.10, the\n      printer worked out of the box. No installation, no anything.\n\n      <p><b>Another user:</b> Works pretty well with\n      Brother's HL-2030 driver. The only minor problem I have for\n      the moment is that the margins are larger than\n      announced.</p>\n\n      Consumables/Refills: Toner: Brother toner TN-2000 s/w (2.500\n      pages at 5%); drum unit: DR-2000</p>"
}