{
  "id": "Brother-HL-2035",
  "manufacturer": "Brother",
  "model": "HL-2035",
  "series": "",
  "connectivity": [],
  "recommended_driver": "driver/hl1250",
  "drivers": [
    {
      "id": "driver/gutenprint",
      "name": "gutenprint",
      "url": "http://gimp-print.sourceforge.net/",
      "comments": "<B>This driver is available in the <A href=\"https://github.com/OpenPrinting/gutenprint-printer-app\">Gutenprint Printer Application</A></B><P>\n<iframe src=\"https://snapcraft.io/gutenprint-printer-app/embedded?button=black&summary=true\" frameborder=\"0\" width=\"100%\" height=\"300px\" style=\"border: 1px solid #CCC; border-radius: 2px;\"></iframe>\n\n    Gutenprint supports a wide variety of Epson Stylus, HP DeskJet,\n    Canon BubbleJet, Lexmark inkjet printers, PCL laser printers, and\n    Canon, Fujifilm, Sony, Olympus dye sublimation printers. Its\n    primary goal is uncompromising quality.  Epson Stylus printers in\n    particular are supported in all resolutions and modes, and the\n    latest printers are capable of producing prints that rival\n    photographic prints in quality. This package also offers much\n    faster printing for high quality text and presentation graphics\n    when required.<p>\n\n    Gutenprint is the successor of Gimp-Print, it was renamed with\n    the change from version 4.x to 5.x. All printers which worked with\n    Gimp-Print before, work also (and hopefully better) with\n    Gutenprint.<p>\n\n    The actual printer drivers are in the Gutenprint library. To give\n    access to them Gutenprint has various interfaces:<p>\n\n    <ol>\n\n    <li><em>Plug-in for the GIMP</em>: This plug-in\n    provides a printing dialog for the GIMP to print images directly,\n    and graphical controls to adjust the rich set of options of the\n    Gutenprint drivers. The possibility to integrate a PPD file and to\n    print PostScript allows to use the plug-in also with Ghostscript\n    drivers other than Gutenprint or on PostScript printers.<p>\n\n    <li><em>Native CUPS driver</em>: This interface\n    makes it possible to set up print queues under CUPS so that one\n    can print from any application or from the command line. As it\n    integrates directlty into the CUPS filtering system it is easy to\n    set up in any CUPS 1.1.x or CUPS 1.2.x version without need of any\n    additional software. With Foomatic it is even possible to use this\n    native CUPS driver with other spoolers than CUPS.<p>\n\n    <li><em>Ghostscript IJS plug-in</em>: This is a\n    way to use Gutenprint as a Ghostscript driver without necessity of\n    patching and recompiling Ghostscript. It uses the <a\n    href=\"http://www.openprinting.org/ijs/\">IJS</a>\n    plug-in interface as also <a\n    href=\"show_driver.cgi?driver=hpijs\">HPIJS</a>\n    from HP or <a\n    href=\"http://sourceforge.net/projects/epsonepl/\">the\n    drivers for the Epson EPL-....L series</a> do. IJS drivers\n    can be used with any IJS-enabled Ghostscript as ESP Ghostscript\n    7.x or newer, GNU Ghostscript 6.53 or newer, APFL Ghostscript 7.04\n    or newer. With the Foomatic data coming with Gutenprint and the\n    current <a\n    href=\"http://www.openprinting.org/foomatic.html\">Foomatic</a>\n    packages PPD files for use with all printing systems (CUPS, LPRng,\n    LPD, GNUlpr, PPR, PDQ, CPS, spooler-less printing) can be\n    generated. Print queues set up with these PPD files and\n    <tt>foomatic-rip</tt> give full access to all options\n    of the Gutenprint driver.<p>\n\n    </ol>\n\n    The Gutenprint package already ships with all needed PPD files for\n    CUPS and data files for Foomatic. Therefore we do not provide PPD\n    files for download here.<p>\n\n    If you got Gutenprint with your operating system distribution, use\n    the printer setup program coming with your distribution. Otherwise\n    it is recommended to use the CUPS driver if you use CUPS as your\n    printing system or the IJS driver if you use another\n    spooler.<p>\n\n    <b>IMPORTANT: Always use the Foomatic data and/or\n    PPD files of the Gutenprint version which you are actually using!\n    Remove and re-create your print queues after every update of\n    Gutenprint. If you are using the Gutenprint package of your Linux\n    distribution, it is possible that the Foomatic data and/or the PPD\n    files can be in separate packages. Make sure you install them and\n    that they are of the version corresponding to your Gutenprint\n    package.</b><p>\n\n    The information currently here corresponds to driver version\n    5.2.7. If you use another version, have a look in the\n    documentation coming with your Gutenprint package. If you have\n    still a 4.x version of Gimp-Print, it is highly recommended to\n    upgrade at least to Gutenprint 5.0.x.<p>\n\n    The driver package which is available for download here on this\n    site only contains the CUPS driver and the utilities (escputil,\n    cups-calibrate), it does not contain the IJS driver and the GIMP\n    plug-in.<p>",
      "execution": {
        "cups": null
      }
    }
  ],
  "type": "laser",
  "status": "good",
  "notes": "<p><b>User comment:</b> I bought this printer\n      today (22-9-2008) and I am using it at home to print text. I did\n      not test all its possibilities and I am not going to. Therefore\n      I choose \"Mostly\", but maybe it deserves more. When\n      printing photographs at HQ1200dpi you sometimes get an second\n      page stating \"There is not enough memory... The printer has\n      printed at a reduced resolution\". This is funny because a\n      GDI printer is supposed to have a little memory because the job\n      is done by the computer. But if you really wanted to print\n      photos, you would buy a good colour printer. Let me say that it\n      is quite noisy when printing but that this is not an issue\n      because it very soon goes back to sleep and that it is a\n      noiseless sleep. I find it a real advantage that it has a true\n      closed paper tray (250 sheets). Some printers in that category\n      have a protruding paper tray (for 100 à 150 sheets) in the good\n      old deskjet style. A closed tray under the printer lets no dust\n      in and takes less valuable real estate (as they say in American\n      computer magazines) from your desk.</p>\n\n      <p>Brother proposes its own software on the page <a\n      href=\"http://solutions.brother.com/linux/en_us/index.html\">http://solutions.brother.com/linux/en_us/index.html</a>.\n      Under HL-2035, it sends back to HL-2030. I downloaded\n      <code>brhl2030lpr-2.0.1-1.i386.deb</code> and\n      installed it by simply double clicking it (not in a terminal and\n      not with the suggested <code>--force-all\n      --force-architecture</code>).  I downloaded\n      <code>cupswrapperHL2030-2.0.1-2.i386.deb</code> and\n      installed it by simply double clicking it, but that gave an\n      error.  I then read and applied the \"pre-required\n      procedures\" for Ubuntu 8.04 on Brother's web site,\n      installed again (again without the suggested\n      <code>--force-all --force-architecture</code>) and\n      that was successful. I choose the <code>Brother HL2030 for\n      CUPS</code> driver, that I suppose was the one I just\n      installed with the Debian package.</p>\n\n      <p><b>Update.</b> After I did this, I\n      discovered in the forum that Debian packages are available in\n      the Multiverse repository for Ubuntu 8.04. These are supposed to\n      be improved versions from Brother's. Therefore, under\n      Ubuntu (and maybe with Debian or other Debian derivatives),\n      simply read <a\n      href=\"https://wiki.ubuntu.com/BrotherDriverPackaging\">https://wiki.ubuntu.com/BrotherDriverPackaging</a>\n      and install the appropriate packages. Through Synaptic,\n      selecting <code>brother-cups-wrapper-laser</code> is\n      sufficient, the lpr stuff being installed as a dependency. This\n      uninstalls Brother's packages. This leaves the printer\n      without any driver during installation and it could be necessary\n      to reactivate the printer after installation.</p>\n\n      Consumables/Refills: Toner TN-2005 (up to 1500 pages) ; Drum\n      DR-2005 (up to 12 000 pages)</p>"
}