{
  "id": "HP-LaserJet_5000",
  "manufacturer": "HP",
  "model": "LaserJet 5000",
  "series": "",
  "connectivity": [],
  "recommended_driver": "driver/hplip",
  "drivers": [
    {
      "id": "driver/Postscript",
      "name": "Postscript",
      "url": "http://partners.adobe.com/public/developer/ps/index_specs.html",
      "comments": "<B>This driver is available in the <A href=\"https://github.com/OpenPrinting/ghostscript-printer-app\">Ghostscript Printer Application</A></B><P>\n<iframe src=\"https://snapcraft.io/ghostscript-printer-app/embedded?button=black&summary=true\" frameborder=\"0\" width=\"100%\" height=\"300px\" style=\"border: 1px solid #CCC; border-radius: 2px;\"></iframe>\n\n    Generic Postscript \"driver\". Generally, for Postscript\n    printers, you will not need a driver, as all applications produce\n    PostScript. For the printing system getting access to the\n    printer-specific features the manufacturer supplies a PPD file for\n    every PostScript printer. Use this PPD file instead of a\n    Foomatic-generated one to get all functionality of your PostScript\n    printer working. The files provided by Foomatic are generic files\n    which contain only some standard options, use them only if you do\n    not find an appropriate PPD for your printer.<p>\n\n    One can make use of all functionality which the PostScript\n    printers have under Windows/MacOS when one uses the PPD file\n    coming with the printer, downloaded from <a\n    href=\"/download/PPD/\">here on OpenPrinting</a>, from the\n    manufacturer's home page, or from <a\n    href=\"http://www.adobe.com/products/printerdrivers/winppd.html\">Adobe's</a>\n    web site (do \"<tt>unzip -L [filename].EXE</tt>\" to get the\n    PPD files). If there are several different PPD files for your\n    printer model and none dedicated for Linux or Unix, the PPD for\n    Windows NT works best in most cases.<p>\n\n    CUPS and PPR support PPD files directly, LPD/GNUlpr/LPRng, PDQ,\n    CPS, and spooler-less users can set up their printers with\n    <tt>foomatic-rip</tt> as they would set up a printer\n    with a Foomatic PPD file. <tt>foomatic-rip</tt> works\n    as well with manufacturer-supplied PostScript PPD files. This way\n    all PostScript printers work perfectly under GNU/Linux or other\n    free operating systems. Ghostscript is not needed for them. See\n    also our <a href=\"ppd-doc.html\">PPD documentation\n    page</a> for instructions.<p>\n\n    See the tutorial chapter \"<a\n    href=\"http://www.openprinting.org/kpfeifle/LinuxKongress2002/Tutorial/III.PostScript-and-PPDs/III.PostScript-and-PPDs.html\">Some\n    Theoretical Background: CUPS, PPDs, PostScript, and\n    Ghostscript</a>\" (<a\n    href=\"http://www.openprinting.org/kpfeifle/LinuxKongress2002/Tutorial/III.PostScript-and-PPDs/III.PostScript-and-PPDs.pdf\">PDF</a>)\n    for detailed information about PostScript and PPD files.<p>",
      "execution": {
        "postscript": null,
        "nopageaccounting": null,
        "prototype": "cat%A%B%Z"
      }
    },
    {
      "id": "driver/gimp-print",
      "name": "gimp-print",
      "url": "http://gimp-print.sourceforge.net/",
      "comments": "Gimp-Print supports a wide variety of Epson Stylus, HP DeskJet,\n    LaserJet, Canon BubbleJet, Lexmark inkjet printers, with the\n    primary goal being uncompromising quality.  Epson Stylus printers\n    in particular are supported in all resolutions and modes, and the\n    latest printers are capable of producing prints that rival\n    photographic prints in quality. This package also offers much\n    faster printing for high quality text and presentation graphics\n    when required.<p>\n\n    The actual printer drivers are in the Gimp-Print library. To give\n    access to them Gimp-Print has various interfaces:<p>\n\n    <ol>\n\n    <li><em>Plug-in for the GIMP</em>: This plug-in\n    provides a printing dialog for the GIMP to print images directly,\n    and graphical controls to adjust the rich set of options of the\n    Gimp-Print drivers. The possibility to integrate a PPD file and to\n    print PostScript allows to use the plug-in also with Ghostscript\n    drivers other than Gimp-Print or on PostScript printers.<p>\n\n    <li><em>Native CUPS driver</em>: This interface\n    makes it possible to set up print queues under CUPS so that one\n    can print from any application or from the command line. As it\n    integrates directlty into the CUPS filtering system it is easy to\n    set up in any CUPS 1.1.x version without need of any additional\n    software. With Foomatic it is even possible to use this native\n    CUPS driver with other spoolers than CUPS.<p>\n\n    <li><em>Ghostscript IJS plug-in</em>: This is a\n    way use Gimp-Print as a Ghostscript driver without necessity of\n    patching and recompiling Ghostscript. It uses the <a\n    href=\"http://www.openprinting.org/ijs/\">IJS</a>\n    plug-in interface as also <a\n    href=\"show_driver.cgi?driver=hpijs\">HPIJS</a>\n    from HP or <a\n    href=\"http://sourceforge.net/projects/epsonepl/\">the\n    drivers for the Epson EPL-....L series</a> do. IJS drivers\n    can be used with any IJS enabled Ghostscript as ESP Ghostscript\n    7.x or newer, GNU Ghostscript 6.53 or newer, APFL Ghostscript 7.04\n    or newer. With the Foomatic data coming with Gimp-Print and the\n    current <a\n    href=\"http://www.openprinting.org/foomatic.html\">Foomatic</a>\n    packages PPD files for use with all printing systems (CUPS, LPRng,\n    LPD, GNUlpr, PPR, PDQ, CPS, spooler-less printing) can be\n    generated. Print queues set up with these PPD files and\n    <tt>foomatic-rip</tt> give full access to all options\n    of the Gimp-Print driver.<p>\n\n    <li><em>Ghostscript built-in driver</em>: This\n    is a classical Ghostscript driver based on code compiled into the\n    Ghostscript executable. The Gimp-Print package also contains the\n    Foomatic data to generate PPDs for this driver. Note that the IJS\n    driver gives the same functionality and is much easier to\n    install. Therefore this interface of Gimp-Print is obsolete and\n    not part of Gimp-Print 4.3 (upcoming 5.0) any more.<p>\n\n    </ol>\n\n    The Gimp-Print package already ships with all needed PPD files for\n    CUPS and data files for Foomatic. Therefore we do not provide PPD\n    files for download here.<p>\n\n    If you got Gimp-Print with your operating system distribution, use\n    the printer setup program coming with your distribution. Otherwise\n    it is recommended to use the CUPS driver if you use CUPS as your\n    printing system or the IJS driver if you use another spooler. Do\n    not use the Ghostscript built-in driver \"stp\" as it is\n    obsolete.<p>\n\n    <b>IMPORTANT: Always use the Foomatic data and/or\n    PPD files of the Gimp-Print version which you are actually using!\n    Remove and re-create your print queues after every update of\n    Gimp-Print. If you are using the Gimp-Print package of your Linux\n    distribution, it is possible that the Foomatic data and/or the PPD\n    files can be in separate packages. Make sure you install them and\n    that they are of the version corresponding to your Gimp-Print\n    package.</b><p>\n\n    The information currently here corresponds to driver version\n    4.2.7. If you use another version, have a look in the\n    documentation coming with your Gimp-Print package. If you have\n    still a 4.0.x version of Gimp-Print, it is highly recommended to\n    upgrade to 4.2.x.<p>",
      "execution": {
        "cups": null
      }
    },
    {
      "id": "driver/gutenprint",
      "name": "gutenprint",
      "url": "http://gimp-print.sourceforge.net/",
      "comments": "<B>This driver is available in the <A href=\"https://github.com/OpenPrinting/gutenprint-printer-app\">Gutenprint Printer Application</A></B><P>\n<iframe src=\"https://snapcraft.io/gutenprint-printer-app/embedded?button=black&summary=true\" frameborder=\"0\" width=\"100%\" height=\"300px\" style=\"border: 1px solid #CCC; border-radius: 2px;\"></iframe>\n\n    Gutenprint supports a wide variety of Epson Stylus, HP DeskJet,\n    Canon BubbleJet, Lexmark inkjet printers, PCL laser printers, and\n    Canon, Fujifilm, Sony, Olympus dye sublimation printers. Its\n    primary goal is uncompromising quality.  Epson Stylus printers in\n    particular are supported in all resolutions and modes, and the\n    latest printers are capable of producing prints that rival\n    photographic prints in quality. This package also offers much\n    faster printing for high quality text and presentation graphics\n    when required.<p>\n\n    Gutenprint is the successor of Gimp-Print, it was renamed with\n    the change from version 4.x to 5.x. All printers which worked with\n    Gimp-Print before, work also (and hopefully better) with\n    Gutenprint.<p>\n\n    The actual printer drivers are in the Gutenprint library. To give\n    access to them Gutenprint has various interfaces:<p>\n\n    <ol>\n\n    <li><em>Plug-in for the GIMP</em>: This plug-in\n    provides a printing dialog for the GIMP to print images directly,\n    and graphical controls to adjust the rich set of options of the\n    Gutenprint drivers. The possibility to integrate a PPD file and to\n    print PostScript allows to use the plug-in also with Ghostscript\n    drivers other than Gutenprint or on PostScript printers.<p>\n\n    <li><em>Native CUPS driver</em>: This interface\n    makes it possible to set up print queues under CUPS so that one\n    can print from any application or from the command line. As it\n    integrates directlty into the CUPS filtering system it is easy to\n    set up in any CUPS 1.1.x or CUPS 1.2.x version without need of any\n    additional software. With Foomatic it is even possible to use this\n    native CUPS driver with other spoolers than CUPS.<p>\n\n    <li><em>Ghostscript IJS plug-in</em>: This is a\n    way to use Gutenprint as a Ghostscript driver without necessity of\n    patching and recompiling Ghostscript. It uses the <a\n    href=\"http://www.openprinting.org/ijs/\">IJS</a>\n    plug-in interface as also <a\n    href=\"show_driver.cgi?driver=hpijs\">HPIJS</a>\n    from HP or <a\n    href=\"http://sourceforge.net/projects/epsonepl/\">the\n    drivers for the Epson EPL-....L series</a> do. IJS drivers\n    can be used with any IJS-enabled Ghostscript as ESP Ghostscript\n    7.x or newer, GNU Ghostscript 6.53 or newer, APFL Ghostscript 7.04\n    or newer. With the Foomatic data coming with Gutenprint and the\n    current <a\n    href=\"http://www.openprinting.org/foomatic.html\">Foomatic</a>\n    packages PPD files for use with all printing systems (CUPS, LPRng,\n    LPD, GNUlpr, PPR, PDQ, CPS, spooler-less printing) can be\n    generated. Print queues set up with these PPD files and\n    <tt>foomatic-rip</tt> give full access to all options\n    of the Gutenprint driver.<p>\n\n    </ol>\n\n    The Gutenprint package already ships with all needed PPD files for\n    CUPS and data files for Foomatic. Therefore we do not provide PPD\n    files for download here.<p>\n\n    If you got Gutenprint with your operating system distribution, use\n    the printer setup program coming with your distribution. Otherwise\n    it is recommended to use the CUPS driver if you use CUPS as your\n    printing system or the IJS driver if you use another\n    spooler.<p>\n\n    <b>IMPORTANT: Always use the Foomatic data and/or\n    PPD files of the Gutenprint version which you are actually using!\n    Remove and re-create your print queues after every update of\n    Gutenprint. If you are using the Gutenprint package of your Linux\n    distribution, it is possible that the Foomatic data and/or the PPD\n    files can be in separate packages. Make sure you install them and\n    that they are of the version corresponding to your Gutenprint\n    package.</b><p>\n\n    The information currently here corresponds to driver version\n    5.2.7. If you use another version, have a look in the\n    documentation coming with your Gutenprint package. If you have\n    still a 4.x version of Gimp-Print, it is highly recommended to\n    upgrade at least to Gutenprint 5.0.x.<p>\n\n    The driver package which is available for download here on this\n    site only contains the CUPS driver and the utilities (escputil,\n    cups-calibrate), it does not contain the IJS driver and the GIMP\n    plug-in.<p>",
      "execution": {
        "cups": null
      }
    },
    {
      "id": "driver/hplip",
      "name": "hplip",
      "url": "https://developers.hp.com/hp-linux-imaging-and-printing",
      "comments": "<B>This driver is available in the <A href=\"https://github.com/OpenPrinting/hplip-printer-app\">HPLIP Printer Application</A></B><P>\n<iframe src=\"https://snapcraft.io/hplip-printer-app/embedded?button=black&summary=true\" frameborder=\"0\" width=\"100%\" height=\"300px\" style=\"border: 1px solid #CCC; border-radius: 2px;\"></iframe>\n\n   HP Linux Imaging and Printing (HPLIP) is an HP-developed\n   solution for printing, scanning, and faxing with HP inkjet and\n   laser based printers in Linux. The HPLIP project provides printing\n   support for over 3000 printer models, including Deskjet,\n   Officejet, Photosmart, PSC (Print, Scan, Copy), Business Inkjet, Envy,\n   NeverStop, Smart Tank, Tango, DesignJet,\n   (Color) LaserJet, Mopier, Edgeline MFP, and LaserJet MFP.<P>\n\n   Note that most HP models are supported, but a few are not. See\n   <a\n   href=\"https://developers.hp.com/hp-linux-imaging-and-printing/supported_devices/index\">Supported\n   Devices</a> at the HPLIP website for more\n   information.<P>\n\n   HPLIP is free, open source software distributed under the MIT, BSD,\n   and GPL licenses. HP does not provide formal consumer or commercial\n   support for this software.<P>\n\n   HPLIP contains two flavors of the printer driver. The default\n   driver is the CUPS Raster driver \"hpcups\" and as alternative the\n   older IJS-based HPIJS driver is still available, but its development and\n   support has been discontinued. In addition there\n   are ready-made PPD files for all supported PostScript printers, so\n   that they get used in PostScript mode. HPLIP ships updated PPD\n   files for all HP printers and both driver flavors. Therefore we do\n   not provide PPD files here. For non-HP printers which work with\n   HPIJS we provide PPDs via the driver entries \"<a\n   href=\"show_driver.cgi?driver=hpijs-pcl3\">hpijs-pcl3</a>\",\n   \"<a\n   href=\"show_driver.cgi?driver=hpijs-pcl5e\">hpijs-pcl5e</a>\",\n   \"<a\n   href=\"show_driver.cgi?driver=hpijs-pcl5c\">hpijs-pcl5c</a>\".<P>",
      "execution": {
        "cups": null,
        "nopjl": null
      }
    },
    {
      "id": "driver/omni",
      "name": "omni",
      "url": "http://omniprint.sourceforge.net/",
      "comments": "<b>NOTE: It seems that IBM is not maintaining any more the\n    Omni printer driver framework, as the driver homepage at IBM and\n    any mention of it on IBM's web sites disappeared. There is still a\n    SourceForge project where version 0.9.2 was added as the last\n    release in September 2004.<p>\n\n    To keep this repository of technology, especially its excellent\n    XML-data-driven concept and also the knowledge about the more than\n    450 printers Omni supported, in mind of users and driver\n    developers, we have added this entry now.<p>\n\n    We do not recommend to use Omni in production environments and\n    also do not develop on or maintain the project. Volunteers for\n    continuing this development are welcome. And anyway, this code is\n    free software and so it can help you developing your own\n    drivers.<p></b>\n\n    <b>Thanks to IBM and Mark Hamzy, Pete Zannucci, and Mark\n    VanderWiele for working out this great concept!</b><p>\n\n    IBM's free Ghostscript driver project to support arround 450\n    printers, based on the knowledge about these printers of OS/2\n    times. The drivers itself are in dynamic libraries and nearly all\n    printer information they work with is in an XML database, so that\n    when the driver root is once built into Ghostscript, new drivers\n    can be added without Ghostscript rebuild (the first plug-in\n    approach for Ghostscript drivers).<p>\n\n    Omni provides a model for dynamically loading printer drivers,\n    creating new devices by editing XML device description files, and\n    simplifies new printer driver development by allowing for the\n    subclassing of previous device features.<p>\n\n    It was also planned to add run-time integration of printers\n    described by <a\n    href=\"http://www.pwg.org/updf/index.html\">UPDF</a>\n    files. Initial code for that is already in the package.<p>\n\n    Foomatic data and CUPS PPD files are built by the driver\n    package. The versions 0.9.1 and 0.9.2 of Omni you find also <a\n    href=\"/download/printing/omni/\">here</a>.<p>",
      "execution": {
        "ghostscript": null
      }
    }
  ],
  "type": "laser",
  "status": "perfect",
  "notes": "For basic printing functionality use the Postscript PPD.\n    For advanced functionality such as printer status, maintenance \n    features, scanning and photo card unload use the <a href=\"\n    http://hplipopensource.com/\">HPLIP driver</a> (which includes \n    HPIJS). <p>\n    \n    PostScript L2,\nPCL5, PCL6\n<br>4/8/12MB std, depending on flavour.\nWide Format printer - if the paper size exists, it can print on it up to Ledger and A3\n<br> \nOptional accessories are duplexer, 250 sheet tray, 500 sheet tray, hard drive, extra memory\n<br>\nWorks well with the generic Postscript Driver<p>\n\n      Consumables/Refills: Cartridge<p>"
}