{
  "id": "KONICA_MINOLTA-magicolor_2430_DL",
  "manufacturer": "KONICA MINOLTA",
  "model": "magicolor 2430 DL",
  "series": "",
  "connectivity": [],
  "recommended_driver": "driver/rastertokmXXXXdl",
  "drivers": [
    {
      "id": "driver/foo2zjs",
      "name": "foo2zjs",
      "url": "http://foo2zjs.rkkda.com/",
      "comments": "<B>This driver is available in the <A href=\"https://github.com/OpenPrinting/ghostscript-printer-app\">Ghostscript Printer Application</A></B><P>\n<iframe src=\"https://snapcraft.io/ghostscript-printer-app/embedded?button=black&summary=true\" frameborder=\"0\" width=\"100%\" height=\"300px\" style=\"border: 1px solid #CCC; border-radius: 2px;\"></iframe>\n\n\tThis is a driver originally developed for the Minolta\n\tmagicolor 2300 DL network color laser printer which uses\n\tthe Zenographics protocol.\n\n\t<p>\n\n\tThis driver will also work for the HP LaserJet 1000, 1005,\n\t1018, 1020, 1022, P1102, P1566, P1606dn, P2035, and other\n\tZenographics-based printers.\n\n\t<p>\n\n\tNote that these HP LaserJet models need their firmware loaded\n\tinto the printer everytime when the printer is turned\n\ton. Please follow the instructions comming with the driver.\n\n\t<p>\n\n\tTill Kamppeter has tested this driver on the LaserJet 1022 and\n        there the driver works very well. It is faster and more\n        reliable then the HPIJS driver for the PCL 5e mode of this\n        model.\n\n\t<p>\n\n\tPPD files (and the Foomatic XML files to generate them) come\n\twith the driver, therefore we do not supply PPDs here on the\n\tOpenPrinting site.",
      "execution": {
        "filter": null
      }
    },
    {
      "id": "driver/rastertokmXXXXdl",
      "name": "rastertokmXXXXdl",
      "url": "http://printer.konicaminolta.com/support/index_ds.html",
      "comments": "Drivers for the KONICA MINOLTA magicolor DL series, supplied by\n    KONICA MINOLTA.<p>\n\n    The KONICA MINOLTA magicolor DL series are rather cheap color\n    laser printers with a Zenographics-based protocol. Some of them\n    are therefore also supported by the \"foo2zjs\" driver. Note that\n    there is also a KONICA MINOLTA magicolor W series which has no\n    Linux support from KONICA MINOLTA. At least some of them work with\n    the \"m2300w\" and \"m2400w\" drivers.<p>\n\n    The drivers which KONICA MINOLTA supplies for the magicolor DL\n    series are entirely free software, there are no binary-only pieces\n    inside. So you can compile, and optimize the driver for your\n    system platform, security-audit the code and make the driver also\n    part of a Linux distribution,<p>\n\n    The drivers are CUPS raster drivers. So they need the CUPS\n    libraries, and Ghostscript with the \"cups\" device built-in (for\n    example ESP Ghostscript). PPD files come with the driver package,\n    therefore no PPDs are available on OpenPrinting.<p>\n\n    The drivers support all functionality of the printers except\n    \"EAIDC\" (automatically adjust halftone during the jobs). Even\n    color management is supported and appropriate ICC profiles are\n    included in the driver package.<p>\n\n    The KONICA MINOLTA magicolor 2300 DL is not officially supported\n    but works with the driver and PPD file for the 2430 DL. Mote that\n    there is also a Minolta magicolor 2300 DL (without \"KONICA\") which\n    is similar but not exactly the same. If someone of you has this\n    model, please report here whether it also works.<p>\n\n    To obtain the drivers, go to the site mentioned here, choose your\n    printer model under \"Color Laser\", and then choose \"Linux\" under\n    \"Drivers, PPDs, & Utilities\". You can also find the drivers <a\n    href=\"http://www.openprinting.org/download/printing/konicaminolta/\">here\n    on OpenPrinting</a>, but be aware that they are perhaps\n    not up-to-date.<p>",
      "execution": {
        "cups": null
      }
    }
  ],
  "type": "laser",
  "status": "good",
  "notes": "The magicolor 2430 DL is a network color laser printer with a\n\t2005 street price of $500 USD. This printer is supported by a\n\tfree CUPS driver supplied by Konica Minolta and also by the\n\t\"foo2zjs\" free software printer driver.\n\n\tNote that the older Minolta magicolor 2430 DL and the newer\n\tKonica Minolta magicolor 2430 DL are not 100% equal. So it is not\n\tsure whether the Minolta magicolor 2430 DL perhaps also works with\n\tthe driver from Konica Minolta.<p><p>\n\n      Consumables/Refills: <br>\n\t\tToner Black (4500 prints) - $79<br>\n\t\tToner Yellow (4500 prints) - $119<br>\n\t\tToner Magenta (4500 prints) - $119<br>\n\t\tToner Cyan (4500 prints) - $119<br>\n\t\tDrum Catridge (45000 prints) - $149<br> Part numbers: 1710587-004, \n\t    1710587-005, \n\t    1710587-006, \n\t    1710587-007, \n\t    1710591-001<p>"
}