{
  "id": "Lexmark-3200",
  "manufacturer": "Lexmark",
  "model": "3200",
  "series": "",
  "connectivity": [],
  "recommended_driver": "driver/lxm3200-tweaked",
  "drivers": [
    {
      "id": "driver/lxm3200-tweaked",
      "name": "lxm3200-tweaked",
      "url": "http://www.openprinting.org/download/printing/",
      "comments": "<B>This driver is available in the <A href=\"https://github.com/OpenPrinting/ghostscript-printer-app\">Ghostscript Printer Application</A></B><P>\n<iframe src=\"https://snapcraft.io/ghostscript-printer-app/embedded?button=black&summary=true\" frameborder=\"0\" width=\"100%\" height=\"300px\" style=\"border: 1px solid #CCC; border-radius: 2px;\"></iframe>\n\n    Tweaked version of Daniel Gordini's \"lxm3200\" driver for\n    the Lexmark 3200. Boer Attila (boera at unitbv dot ro) and Tomas\n    Groth (tomasgroth at hotmail dot com) discovered that this driver\n    works also on the Z12 and the Z31 when one does some small\n    tweaking on it. So they have made a modified version of the\n    original driver, with an additional\n    \"<tt>-dmodel=</tt><i>n</i>\"\n    (Lexmark 3200: <i>n</i><tt> = 0</tt>, Z12:\n    <i>n</i><tt> = 1</tt>, Z31:\n    <i>n</i><tt> = 2</tt>) option to fit the\n    driver to the appropriate model.<p>\n\n    Notes:<p>\n\n    The 1200 dpi will come out somewhat dark, correct this by the\n    gamma correction of CUPS, or use the 600dpi resolution (native\n    resolution of the printer).<p>\n\n    Unidirectional printing on the Z12 and the Z31 is possible and gives a\n    much higher printout quality.<p>\n\n    From the Z31 there came out models which need different margin\n    settings. If the print head of your Z31 goes over the end of its\n    rails and makes strange noise, use the\n    \"<tt>-dz31m=</tt><i>x</i>\"\n    option where <i>x</i> is an integer number adjusting\n    the margins. Default (when not using the option) is 100, You\n    should try something like 300, but other values can also\n    apply.<p>\n\n    The Compaq IJ750 is a rebadged Lexmark 3200, so use it with\n    \"<tt>-dmodel=0</tt>\".<p>\n\n    The Z22 and Z32 have protocols similar to the Lexmark 3200 and\n    work partially with this driver\n    (\"<tt>-dmodel=0</tt>\"). Note that you have\n    to turn off and on the Z22/Z32 after the job has finished. For\n    black text printing this driver is usable on the Z22/Z32. But note\n    that these printers are not officially supported by this\n    driver. Use Lexmark's drivers for the Z22/Z32.<p>\n\n    This driver is also in the CVS of <a\n    href=\"http://www.cups.org/ghostscript.php\">ESP\n    Ghostscript</a> (\"lxm3200\" device). When one does\n    not use the\n    \"<tt>-dmodel=</tt><i>n</i>\"\n    option, the driver behaves as the original \"lxm3200\"\n    driver.<p>\n\n    Alternative download place (probably not the newest version):\n    <a\n    href=\"http://www.distantvoices.org/\">http://www.distantvoices.org/</a>",
      "execution": {
        "ghostscript": null,
        "prototype": "gs -q -dBATCH -dPARANOIDSAFER -dQUIET -dNOPAUSE -dNOMEDIAATTRS -dNOINTERPOLATE -sDEVICE=lxm3200%A%Z -sOutputFile=- -"
      }
    },
    {
      "id": "driver/lxm3200",
      "name": "lxm3200",
      "url": "http://lxm3200.sourceforge.net/",
      "comments": "<b>New Maintainer Wanted!</b> Daniel Gordini, the\n    current maintainer of this driver, cannot maintain it any more for\n    personal reasons. After not being able to do anything on it in the\n    last nine months he told me that the best is that someone else\n    overtakes the project. He also cannot maintain the driver inside\n    Gimp-Print any more and due to the fast development of Gimp-Print\n    this driver stopped working.<p>\n\n    So I ask all people with a Lexmark 3200 and programming skills for\n    thinking about overtaking this project, especially as Gimp-Print\n    driver. Because the protocols of the Z22, Z31, and Z32 are similar\n    you do not work on a dead driver, expand it to work correctly also\n    on these models (it already works partially). The Z52 (completely\n    different protocol) advanced from \"Paperweight\" to\n    \"Perfectly\" by a Gimp-Print driver having been written\n    for it.<p>\n\n    Please contact Daniel Gordini (dgordin at tin dot it) and the\n    Gimp-Print team (gimp-print-devel at sourceforge dot net) if you\n    want to volunteer.<p>\n\n    If you want to print on a Lexmark 3200 <b>do not</b>\n    use Gimp-Print, the driver inside there does not work.<p>\n\n    This is version 0.4.1 of Daniel Gordini's driver for the Lexmark\n    3200. It replaces the old version 0.3 (driver entries <a\n    href=\"show_driver.cgi?driver=lxm3200m\">lxm3200m</a>,\n    <a\n    href=\"show_driver.cgi?driver=lxm3200c\">lxm3200c</a>, and\n    <a\n    href=\"show_driver.cgi?driver=lxm3200p\">lxm3200p</a>). It\n    is nearly completely rewritten and supports now all resolutions\n    (up to the 1200 dpi which the printer is able to do by its\n    hardware), all colour modes (as before), bidirectional printing,\n    multipass printing, and head alignment.<p>\n\n    This is now the first stable release of the driver, the versions\n    0.3 and 0.4 are not supported any more by the author.<p>\n\n    Notes:<p>\n\n    The 1200 dpi will come out somewhat dark, correct this by the\n    gamma correction of CUPS, or use the 600dpi resolution (native\n    resolution of the printer).<p>\n\n    The Z22, Z31, Z32 have protocols similar to the Lexmark 3200 and\n    work partially with this driver. Note that you have to turn off\n    and on the Z22/Z32 after the job has finished. For black text\n    printing this driver is usable on the Z22/Z32. But note that these\n    printers are not officially supported by this driver. Use\n    Lexmark's drivers for the Z22/Z32.<p>\n\n    On the Z31 printouts will be not well centered. Use the\n    \"lxm3200-tweaked\" driver for this printer.<p>",
      "execution": {
        "ghostscript": null,
        "prototype": "gs -q -dBATCH -dPARANOIDSAFER -dQUIET -dNOPAUSE -dNOMEDIAATTRS -dNOINTERPOLATE -sDEVICE=lxm3200%A%Z -sOutputFile=- -"
      }
    },
    {
      "id": "driver/lxm3200X",
      "name": "lxm3200X",
      "url": "http://lxm3200.sourceforge.net/",
      "comments": "Please use the new <a\n      href=\"show_driver.cgi?driver=lxm3200\">version\n      0.4.1</a> of this driver, version 0.3 is obsolete. This\n      driver entry is only for old Ghostscript binaries which still\n      contain the\n      \"lxm3200c\"/\"lxm3200m\"/\"lxm3200p\"\n      output devices and not the single \"lxm3200\"\n      device.<p>\n\n      This driver supports the Lexmark 3200 ink jet \"GDI\"\n      printers. It prints in monochrome, 4 ink colour and 6 ink colour\n      (photo quality) mode. To do this, the Ghostscript output devices\n      \"lxm3200m\", \"lxm3200c\", and\n      \"lxm3200p\" are used. The user chooses by an option\n      which output device is really used.<p>",
      "execution": {
        "ghostscript": null,
        "prototype": "gs -q -dBATCH -dPARANOIDSAFER -dQUIET -dNOPAUSE -dNOMEDIAATTRS -dNOINTERPOLATE -sDEVICE=%B -r600 %A%Z -sOutputFile=- -"
      }
    }
  ],
  "type": "inkjet",
  "status": "good",
  "notes": "Known not to work with Henryk's pbml7k driver, although he\n    put hooks in for future support.<br>\n\n    Luckily Daniel Gordini has written a new driver for it!  His\n    driver needs testing; give it a shot and give Daniel some\n    feedback. Use the 0.4.1 version (lxm3200). It supports all\n    resolutions, all printing modes, head alignment, and more. If your\n    distro has the old version compiled into Ghostscript and you do\n    not like to recompile Ghostscript with the current one, the\n    foomatic data for the old version is still available (lxm3200m,\n    lxm3200c, and lxm3200p).<p><p>\n\n      Consumables/Refills: 1 color & 1 black or \"photo\" cartridge $40<p>"
}